app/Controllers/Post.php

DELETE FROM `artikel`
WHERE `id` = '7'
AND `id` IN ('7')
DELETE FROM `artikel`
WHERE `id` IN ('7')
---
    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->delete($id);
        if ($data) {
            $model->delete($id);